RT-CUSTOMZ/WortUhr/Software/STM32/src/main.c
/*-------------------------------------------------------------------------------------------------------------------------------------------
 * main.c - main routines of wclock24h
 *
 * Copyright (c) 2014-2017 Frank Meyer - frank(at)fli4l.de
 *
 * System Clocks configured on STM32F103 Mini development board:
 *
 *    External 8MHz crystal
 *    SYSCLK:       72MHz ((HSE_VALUE / HSE_Prediv) * PLL_Mul) = ((8MHz / 1) * 9)  = 72MHz
 *    AHB clock:    72MHz (AHB  Prescaler = 1)
 *    APB1 clock:   36MHz (APB1 Prescaler = 2)
 *    APB2 clock:   72MHz (APB2 Prescaler = 1)
 *    Timer clock:  72MHz (APB1 Prescaler = 2, Timer Multiplier 2)
 *
 * System Clocks configured on STM32F401 Nucleo Board (see changes in system_stm32f4xx.c):
 *
 *    External 8MHz crystal
 *    Main clock:   84MHz ((HSE_VALUE / PLL_M) * PLL_N) / PLL_P = ((8MHz / 4) * 84) / 2 = 84MHz
 *    AHB clock:    84MHz (AHB  Prescaler = 1)
 *    APB1 clock:   42MHz (APB1 Prescaler = 2)
 *    APB2 clock:   84MHz (APB2 Prescaler = 1)
 *    Timer clock:  84MHz
 *
 * System Clocks configured on STM32F411 Nucleo Board (see changes in system_stm32f4xx.c):
 *
 *    External 8MHz crystal
 *    Main clock:   100MHz ((HSE_VALUE / PLL_M) * PLL_N) / PLL_P = ((8MHz / 4) * 100) / 2 = 100MHz
 *    AHB clock:    100MHz (AHB  Prescaler = 1)
 *    APB1 clock:    50MHz (APB1 Prescaler = 2)
 *    APB2 clock:   100MHz (APB2 Prescaler = 1)
 *    Timer clock:  100MHz
 *
 * System Clocks configured on STM32F446 Nucleo Board (see changes in system_stm32f4xx.c):
 *
 *    External 8MHz crystal
 *    Main clock:   180MHz ((HSE_VALUE / PLL_M) * PLL_N) / PLL_P = ((8MHz / 4) * 180) / 2 = 180MHz
 *    AHB clock:    180MHz (AHB  Prescaler = 1)
 *    APB1 clock:    45MHz (APB1 Prescaler = 4)
 *    APB2 clock:    90MHz (APB2 Prescaler = 2)
 *    Timer clock:  180MHz
 *
 * On STM32F4xx Nucleo Board, make sure that
 *
 *    - SB54 and SB55 are OFF
 *    - SB16 and SB50 are OFF
 *    - R35 and R37 are soldered (0R or simple wire)
 *    - C33 and C34 are soldered with 22pF capacitors
 *    - X3 is soldered with 8MHz crystal
 *
 * Internal devices used:
 *
 *    +-------------------------+-----------------------------------+-----------------------------------+
 *    | Device                  | STM32F4x1 Nucleo                  | STM32F103C8T6                     |
 *    +-------------------------+-----------------------------------+-----------------------------------+
 *    | User button             | GPIO:   PC13                      | GPIO:   PA6                       |
 *    | Board LED               | GPIO:   PA5                       | GPIO:   PC13                      |
 *    +-------------------------+-----------------------------------+-----------------------------------+
 *
 * External devices:
 *
 *    +-----------------------+---------------------------------------+-----------------------------------+-------------------------------+
 *    | Device                | STM32F4x1 Nucleo                      | STM32F103C8T6                     | Remarks                       |
 *    +-----------------------+---------------------------------------+-----------------------------------+-------------------------------+
 *    | TSOP31238 (IRMP)      | GPIO:          PC10                   | GPIO:      PB3                    |                               |
 *    | DS18xx (OneWire)      | GPIO:          PD2                    | GPIO:      PB5                    |                               |
 *    | Logger (Nucleo: USB)  | USART2:        TX=PA2  RX=PA3         | USART1:    TX=PA9  RX=PA10        |                               |
 *    | WPS button            | GPIO:          PC5                    | GPIO:      PA7                    |                               |
 *    | ESP8266 USART         | USART6:        TX=PA11 RX=PA12        | USART2:    TX=PA2  RX=PA3         |                               |
 *    | ESP8266 RST/CH_PD     | GPIO:          RST=PA7 CH_PD=PA6      | GPIO:      RST=PA0 CH_PD=PA1      |                               |
 *    | ESP8266 GPIO0         | GPIO:          FLASH=PA4              | GPIO:      FLASH=PA4              |                               |
 *    | ESP8266 GPIO13/GPIO15 | USART1:        GPIO13=PA9 GPIO15=PA10 | USART1:    GPIO13=PA9 GPIO15=PA10 | Only in STM32 bootloader mode |
 *    | ESP8266 GPIO14        | GPIO:          GPIO14=RESET           | GPIO:      GPIO14=RESET           |                               |
 *    | ESP8266 GPIO4         | GPIO:          GPIO4=BOOT0            | GPIO:      GPIO4=BOOT0            |                               |
 *    | DCF77                 | GPIO:          DATA=PC11 PON=PC12     | GPIO:      DATA=PB8  PON=PB9      |                               |
 *    | I2C DS3231 & EEPROM   | I2C3:          SCL=PA8 SDA=PC9        | I2C1:      SCL=PB6 SDA=PB7        |                               |
 *    | LDR                   | ADC:           ADC1_IN14=PC4          | ADC:       ADC12_IN5=PA5          |                               |
 *    | WS2812 / SK6812       | TIM3/DMA1:     PC6                    | TIM1/DMA1: PA8                    |                               |
 *    | APA102                | SPI2/DMA1:     SCK=PB13 MOSI=PB15     | SPI2/DMA1: SCK=PB13 MOSI=PB15     |                               |
 *    | Power switch          | GPIO:          PC8                    | GPIO:      PB0                    |                               |
 *    | Beeper                | PWM:           PB1 TIM3/CH4           | PWM:       PB1 TIM3/CH4           |                               |
 *    | DFPlayer              | USART1 (ALT1): TX=PB6  RX=PB7         | USART3:    TX=PB10  RX=PB11       |                               |
 *    +-----------------------+---------------------------------------+-----------------------------------+-------------------------------+
 *    | Free Port A           | PA0 PA1 PA15                          | PA11 PA12 PA15                    |                               |
 *    | Free Port B           | PB0 PB2 PB4  PB5 PB12 PB14            | PB4  PB12 PB14                    |                               |
 *    | Free Port C           | PC3 PC7 PC14 PC15                     | PC14 PC15                         |                               |
 *    +-----------------------+---------------------------------------+-----------------------------------+-------------------------------+
 *
 * Timers:
 *
 *    +-------------------------+-----------------------------------+-----------------------------------+
 *    | Device                  | STM32F4x1 Nucleo                  | STM32F103C8T6                     |
 *    +-------------------------+-----------------------------------+-----------------------------------+
 *    | General (IRMP etc.)     | TIM2                              | TIM2                              |
 *    | WS2812                  | TIM3                              | TIM1                              |
 *    | Beeper                  | TIM4                              | TIM4                              |
 *    | DS18xx (OneWire)        | Systick (see delay.c)             | Systick (see delay.c)             |
 *    +-------------------------+-----------------------------------+-----------------------------------+
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 2 of the License, or
 * (at your option) any later version.
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
#include <stdio.h>
#include <stdint.h>
#include <stdlib.h>
#include <string.h>
#include <time.h>

