RT-CUSTOMZ/WortUhr/Software/STM32/src/main.c
#include "wclock24h-config.h"
#include "base.h"
#include "display.h"
#include "overlay.h"
#include "dcf77.h"
#include "timeserver.h"
#include "esp8266.h"
#include "esp-spiffs.h"
#include "board-led.h"
#include "power.h"
#include "irmp.h"
#include "remote-ir.h"
#include "button.h"
#include "wpsbutton.h"
#include "eeprom.h"
#include "eeprom-data.h"
#include "tempsensor.h"
#include "ds18xx.h"
#include "rtc.h"
#include "ldr.h"
#include "delay.h"
#include "night.h"
#include "alarm.h"
#include "weather.h"
#include "vars.h"
#include "dfplayer.h"
#if WCLOCK24H == 1
#include "tables.h"
#else
#include "tables12h.h"
#endif

#include "tetris.h"
#include "log.h"
#include "nic.h"
#include "nici.h"
#include "main.h"

#define DEFAULT_UPDATE_HOST     "wortuhr.42volt.de"
#define DEFAULT_UPDATE_PATH     "update"

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * global public variables
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
MAIN_GLOBALS                    gmain;

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * global private variables
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
static uint_fast8_t             esp8266_is_online           = 0;
static uint32_t                 eeprom_version              = 0xFFFFFFFF;

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * global private variables, modified by timer ISR
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
static volatile uint_fast8_t    animation_flag              = 0;        // flag: animate LEDs
static volatile uint_fast8_t    seconds_flag                = 0;        // flag: seconds changed
static volatile uint_fast8_t    ds3231_flag                 = 0;        // flag: read date/time from RTC DS3231
static volatile uint_fast8_t    net_time_flag               = 0;        // flag: read date/time from time server
static volatile uint_fast16_t   net_time_countdown          = 3800;     // counter: if it counts to 0, then net_time_flag will be triggered
static volatile uint_fast8_t    ldr_conversion_flag         = 0;        // flag: read LDR value
static volatile uint_fast8_t    measure_temperature_flag    = 0;        // flag: measure temperature from DS18XX
static volatile uint_fast8_t    read_temperature_flag       = 0;        // flag: read temperature from RTC & DS18XX
static volatile uint_fast8_t    read_rtc_temperature_flag   = 0;        // flag: read temperature from RTC
static volatile uint_fast8_t    show_time_flag              = 0;        // flag: update time on display, set every full minute
static volatile uint_fast8_t    half_minute_flag            = 0;        // flag: it is hh:mm:30
volatile uint32_t               uptime                      = 0;        // uptime in seconds
static volatile uint_fast8_t    wday                        = 0;        // current weekday, 0=Sunday
static volatile uint_fast16_t   year                        = 0;        // current year;
static volatile uint_fast8_t    month                       = 0;        // current month;
static volatile uint_fast8_t    mday                        = 0;        // current day of month 1..31;
static volatile uint_fast8_t    hour                        = 0;        // current hour
static volatile uint_fast8_t    minute                      = 0;        // current minute
static volatile uint_fast8_t    second                      = 0;        // current second
static volatile uint_fast8_t    dcf77_enabled               = 0;        // flag: DCF77 enabled (disabled if power is on)
/*-------------------------------------------------------------------------------------------------------------------------------------------
 * timer definitions:
 *
 *      F_INTERRUPTS    = TIM_CLK / (TIM_PRESCALER + 1) / (TIM_PERIOD + 1)
 * <==> TIM_PRESCALER   = TIM_CLK / F_INTERRUPTS / (TIM_PERIOD + 1) - 1
 *
 * STM32F401:
 *      TIM_PERIOD      =   8 - 1 =   7
 *      TIM_PRESCALER   = 700 - 1 = 699
 *      F_INTERRUPTS    = 84000000 / 700 / 8 = 15000 (0.00% error)
 * STM32F411:
 *      TIM_PERIOD      = 101 - 1 = 100
 *      TIM_PRESCALER   =  66 - 1 =  65
 *      F_INTERRUPTS    = 100000000 / 66 / 101 = 15015 (0.01% error)
 * STM32F446:
 *      TIM_PERIOD      =   12 - 1 =  11
 *      TIM_PRESCALER   = 1000 - 1 = 999
 *      F_INTERRUPTS    = 180000000 / 1000 / 12 = 15000 (0.00% error)
 * STM32F103:
 *      TIM_PERIOD      =   6 - 1 =   5
 *      TIM_PRESCALER   = 800 - 1 = 799
 *      F_INTERRUPTS    = 72000000 / 800 / 6 = 15000 (0.00% error)
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
#if   defined (STM32F401RE)                                                 // STM32F401 Nucleo Board
#define TIM_CLK                 84000000L                                   // 84 MHz
#define TIM_PERIOD              7

#elif defined (STM32F411RE)                                                 // STM32F411 Nucleo Board
#define TIM_CLK                 100000000L                                  // 100 MHz
#define TIM_PERIOD              100

#elif defined (STM32F446RE)                                                 // STM32F411 Nucleo Board
#define TIM_CLK                 180000000L                                  // 180 MHz
#define TIM_PERIOD              11

#elif defined (STM32F103)
#define TIM_CLK                 72000000L                                   // timer clock, 72MHz on STM32F103
#define TIM_PERIOD              5
#else
#error STM32 unknown
#endif

#define TIM_PRESCALER           ((TIM_CLK / F_INTERRUPTS) / (TIM_PERIOD + 1) - 1)

#define STATUS_LED_FLASH_TIME   50                                          // status LED: time of flash


/*-------------------------------------------------------------------------------------------------------------------------------------------
 * initialize timer2
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
static void
timer2_init (void)
{
    TIM_TimeBaseInitTypeDef     tim;
    NVIC_InitTypeDef            nvic;

    TIM_TimeBaseStructInit (&tim);
    RCC_APB1PeriphClockCmd (RCC_APB1Periph_TIM2, ENABLE);

