RT-CUSTOMZ/WortUhr/Software/STM32/src/main.c
    return rtc;
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * write update host to EEPROM
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
static uint_fast8_t
write_update_host_to_eeprom (void)
{
    uint_fast8_t    rtc = 0;

    if (eeprom_is_up)
    {
        rtc = eeprom_write (EEPROM_DATA_OFFSET_UPDATE_HOSTNAME, (uint8_t *) gmain.update_host, EEPROM_DATA_SIZE_UPDATE_HOSTNAME);
    }

    return rtc;
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * read update path from EEPROM
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
static uint_fast8_t
read_update_path_from_eeprom (void)
{
    uint_fast8_t    rtc = 0;

    if (eeprom_is_up)
    {
        rtc = eeprom_read (EEPROM_DATA_OFFSET_UPDATE_PATH, (uint8_t *) gmain.update_path, EEPROM_DATA_SIZE_UPDATE_PATH);
    }

    return rtc;
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * write update path to EEPROM
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
static uint_fast8_t
write_update_path_to_eeprom (void)
{
    uint_fast8_t    rtc = 0;

    if (eeprom_is_up)
    {
        rtc = eeprom_write (EEPROM_DATA_OFFSET_UPDATE_PATH, (uint8_t *) gmain.update_path, EEPROM_DATA_SIZE_UPDATE_PATH);
    }

    return rtc;
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * read main parameters from EEPROM
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
static uint_fast8_t
read_main_parameters_from_eeprom (void)
{
    uint_fast8_t    rtc = 0;

    if (eeprom_is_up)
    {
        if (eeprom_version >= EEPROM_VERSION_2_6)
        {
            if (read_update_host_from_eeprom () &&
                read_update_path_from_eeprom ())
            {
                if (gmain.update_host[0] >= 'a' && gmain.update_host[0] <= 'z' &&
                    gmain.update_path[0] >= 'a' && gmain.update_path[0] <= 'z')
                {                                                                   // eeprom correctly initialized?
                    rtc = 1;
                }
            }
        }
    }

    return rtc;
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * write main parameters to EEPROM
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
static uint_fast8_t
write_main_parameters_to_eeprom (void)
{
    uint_fast8_t    rtc = 0;

    if (eeprom_is_up)
    {
        if (write_update_host_to_eeprom () &&
            write_update_path_to_eeprom ())
        {
            rtc = 1;
        }
    }

    return rtc;
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * log eeprom write error
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
static void
log_eeprom_error (const char * str)
{
    log_printf ("Writing %s to EEPROM failed\r\n", str);
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * write version to EEPROM
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
static void
read_configuration_from_eeprom (void)
{
    if (eeprom_is_up)
    {
        log_message ("eeprom is online");
        display_set_status_or_minute_leds (0, 1, 0);                                       // show green status or minute LEDs
        read_version_from_eeprom ();
        log_printf ("current eeprom version: 0x%08x\r\n", eeprom_version);

        if ((eeprom_version & 0xFF0000FF) == 0x00000000 &&
            eeprom_version >= EEPROM_VERSION_1_5 && eeprom_version <= EEPROM_VERSION)
        {                                                                       // Upper and Lower Byte must be 0x00
            gmain.eeprom_version[0] = ((eeprom_version >> 16) & 0xFF) + '0';
            gmain.eeprom_version[1] = '.';
            gmain.eeprom_version[2] = ((eeprom_version >>  8) & 0xFF) + '0';
            gmain.eeprom_version[4] = '\0';

            if (eeprom_version >= EEPROM_VERSION_1_5)
            {
                log_message ("reading ir codes from eeprom");
                remote_ir_read_codes_from_eeprom ();

                debug_log_message ("reading display configuration from eeprom");
                display_read_config_from_eeprom (eeprom_version);

                debug_log_message ("reading timeserver data from eeprom");
                timeserver_read_data_from_eeprom ();
            }

            debug_log_message ("reading overlay configuration from eeprom");
            overlay_read_config_from_eeprom (eeprom_version);

            debug_log_message ("reading night timers from eeprom");
            night_read_data_from_eeprom (eeprom_version);

            debug_log_message ("reading alarm timers from eeprom");
            alarm_read_data_from_eeprom (eeprom_version);

            if (eeprom_version >= EEPROM_VERSION_2_1)
            {
                debug_log_message ("reading temp configuration from eeprom");
                temp_read_config_from_eeprom (eeprom_version);
                rtc_read_config_from_eeprom (eeprom_version);

                debug_log_message ("reading LDR configuration from eeprom");
                ldr_read_config_from_eeprom (eeprom_version);
            }

            if (eeprom_version >= EEPROM_VERSION_2_2)
            {
                debug_log_message ("reading weather configuration from eeprom");
                weather_read_config_from_eeprom ();
            }

            debug_log_message ("reading dfplayer configuration from eeprom");
            dfplayer_read_config_from_eeprom (eeprom_version);

