RT-CUSTOMZ/WortUhr/Software/STM32/src/main.c
            debug_log_message ("reading update host/path configuration from eeprom");
            if (! read_main_parameters_from_eeprom ())
            {
                strcpy (gmain.update_host, DEFAULT_UPDATE_HOST);
                strcpy (gmain.update_path, DEFAULT_UPDATE_PATH);
                write_main_parameters_to_eeprom ();
            }
        }
        display_set_status_or_minute_leds (0, 0, 0);                                       // switch status or minute LEDs off
    }
    else
    {
        log_message ("eeprom is offline");
    }
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * write version to EEPROM
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
static void
upgrade_eeprom_version (void)
{
    if (eeprom_is_up)
    {
        if (eeprom_version != EEPROM_VERSION)
        {
            display_set_status_or_minute_leds (1, 0, 0);                                       // show red status or minute LEDs
            log_printf ("updating EEPROM to version 0x%08x... ", EEPROM_VERSION);

            eeprom_version = EEPROM_VERSION;

            if (! write_version_to_eeprom ())
            {
                log_eeprom_error ("version");
            }

            display_set_status_or_minute_leds (0, 0, 0);                                       // clear status or minute LEDs

            if (! remote_ir_write_codes_to_eeprom ())
            {
                log_eeprom_error ("IR codes");
            }

            display_set_status_or_minute_leds (1, 0, 0);                                       // show red status or minute LEDs

            if (! display_write_config_to_eeprom ())
            {
                log_eeprom_error ("display configuration");
            }

            display_set_status_or_minute_leds (0, 0, 0);                                       // clear status or minute LEDs

            if (! overlay_write_config_to_eeprom ())
            {
                log_eeprom_error ("overlay configuration");
            }

            display_set_status_or_minute_leds (1, 0, 0);                                       // show red status or minute LEDs

            if (! timeserver_write_data_to_eeprom ())
            {
                log_eeprom_error ("timeserver configuration");
            }

            display_set_status_or_minute_leds (0, 0, 0);                                       // clear status or minute LEDs

            if (! night_write_data_to_eeprom ())
            {
                log_eeprom_error ("night time configuration");
            }

            display_set_status_or_minute_leds (1, 0, 0);                                       // show red status or minute LEDs

            if (! alarm_write_data_to_eeprom ())
            {
                log_eeprom_error ("alarm time configuration");
            }

            display_set_status_or_minute_leds (0, 0, 0);                                       // clear status or minute LEDs

            if (! temp_write_config_to_eeprom ())
            {
                log_eeprom_error ("temperature configuration");
            }

            display_set_status_or_minute_leds (1, 0, 0);                                       // show red status or minute LEDs

            if (! rtc_write_config_to_eeprom ())
            {
                log_eeprom_error ("RTC configuration");
            }

            display_set_status_or_minute_leds (0, 0, 0);                                       // clear status or minute LEDs

            if (! ldr_write_config_to_eeprom ())
            {
                log_eeprom_error ("LDR configuration");
            }

            display_set_status_or_minute_leds (1, 0, 0);                                       // show red status or minute LEDs

            if (! weather_write_config_to_eeprom ())
            {
                log_eeprom_error ("weather configuration");
            }

            display_set_status_or_minute_leds (0, 0, 0);                                       // clear status or minute LEDs

            if (! dfplayer_write_config_to_eeprom ())
            {
                log_eeprom_error ("dfplayer configuration");
            }

            display_set_status_or_minute_leds (1, 0, 0);                                       // show red status or minute LEDs

            if (! write_main_parameters_to_eeprom ())
            {
                log_eeprom_error ("update main parameters configuration");
            }

            display_set_status_or_minute_leds (0, 0, 0);                                       // switch status or minute LEDs off

            log_message ("done");
            eeprom_version = EEPROM_VERSION;
        }
    }
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * toggle power
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
static uint_fast8_t
toggle_power (uint_fast8_t do_sync)
{
    uint_fast8_t            display_clock_flag;

    display.power_is_on = ! display.power_is_on;
    display_set_ambilight_power(display.power_is_on);

    display_clock_flag = DISPLAY_CLOCK_FLAG_UPDATE_ALL;

    if (display.power_is_on)
    {
        display_clock_flag |= DISPLAY_CLOCK_FLAG_POWER_ON;
    }
    else
    {
        display_clock_flag |= DISPLAY_CLOCK_FLAG_POWER_OFF;
    }

    if (do_sync && esp8266.is_online)
    {
        var_send_display_power ();
    }

    if (display.power_is_on)
    {
        dcf77_enabled = FALSE;
    }
    else
    {
        dcf77_enabled = TRUE;
    }

    return display_clock_flag;
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * set power
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
static uint_fast8_t
set_power (uint_fast8_t new_power_is_on)
{
    uint_fast8_t            display_clock_flag;

    display.power_is_on = new_power_is_on;
    display_set_ambilight_power(display.power_is_on);

    display_clock_flag = DISPLAY_CLOCK_FLAG_UPDATE_ALL;

    if (display.power_is_on)
    {
        display_clock_flag |= DISPLAY_CLOCK_FLAG_POWER_ON;
    }
    else
    {
        display_clock_flag |= DISPLAY_CLOCK_FLAG_POWER_OFF;
    }

    if (display.power_is_on)
    {
        dcf77_enabled = FALSE;
    }
    else
    {
        dcf77_enabled = TRUE;
    }

