RT-CUSTOMZ/WortUhr/Software/STM32/src/main.c
    return display_clock_flag;
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * speak clock time
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
static void
speak (uint_fast8_t hh, uint_fast8_t mm)
{
    static uint8_t                  words[WP_COUNT];
    uint_fast8_t                    hour_mode;
    uint_fast8_t                    minute_mode;
    uint_fast8_t                    it_is_mode;
#if WCLOCK24H == 1
    const struct MinuteDisplay *    tbl_minute;
#else
    const struct MinuteDisplay12 *  tbl_minute;
#endif
    const uint8_t *                 word_idx_p;
    uint_fast16_t                   idx;

#if WCLOCK24H == 1
    minute_mode = tbl_modes[display.display_mode].minute_txt;
    tbl_minute  = &tbl_minutes[minute_mode][mm];
    hour_mode   = tbl_modes[display.display_mode].hour_txt;
#else
    minute_mode = display.display_mode;
    tbl_minute  = &tbl_minutes[minute_mode][mm / 5];
    hour_mode   = tbl_minute->hour_mode;
#endif

    memset (words, 0, WP_COUNT);

    it_is_mode = tbl_minute->flags & MDF_IT_IS_MASK;
    word_idx_p = tbl_it_is[it_is_mode];
    words[word_idx_p[0]] = 1;
    words[word_idx_p[1]] = 1;

    for (idx = 0; idx < MAX_MINUTE_WORDS && tbl_minute->wordIdx[idx] != 0; idx++)
    {
        words[tbl_minute->wordIdx[idx]] = 1;
    }

#if WCLOCK24H == 0                                              // WC12h: we have only 12 hours
    if (hh >= HOUR_COUNT)
    {
        hh -= HOUR_COUNT;
    }
#endif

    if (tbl_minute->flags & MDF_HOUR_OFFSET_MASK)
    {
        hh += 1;                                                // correct hour offset
    }

    if (hh >= HOUR_COUNT)
    {
        hh -= HOUR_COUNT;
    }

    word_idx_p = tbl_hours[hour_mode][hh];                      // get the hour words from hour table

    for (idx = 0; idx < MAX_HOUR_WORDS && word_idx_p[idx] != 0; idx++)
    {
#if WCLOCK24H == 1                                              // WC24h:
        if (mm == 0 && word_idx_p[idx] == WP_EINS_2)            // fm hack, because it cannot be handled by table:
        {                                                       // patch "ES IST EINS UHR" to "ES IST EIN UHR" at 01:00 & 13:00
            words[WP_EIN_4] = 1;
        }
        else
        {
            words[word_idx_p[idx]] = 1;
        }
#else
        words[word_idx_p[idx]] = 1;
#endif
    }

    dfplayer_flush_queue ();

    for (idx = 0; idx < WP_COUNT; idx++)
    {
        if (words[idx])
        {
            dfplayer_enqueue (idx);
        }
    }

    dfplayer_start_queue ();
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * schedule_esp8266_messages () - schedule messages of ESP8266
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
static uint_fast8_t     show_temperature            = 0;
static uint_fast8_t     display_clock_flag          = DISPLAY_CLOCK_FLAG_UPDATE_ALL;
static uint_fast8_t     show_date                   = 0;
static uint_fast8_t     last_ldr_value              = 0xFF;
static uint_fast8_t     show_overlay_idx            = 0xFF;
static uint_fast8_t     icon_duration               = 0;
static uint32_t         show_icon_stop_time         = 0;
static uint32_t         local_uptime                = 0;

uint_fast8_t
schedule_esp8266_messages (void)
{
    uint_fast8_t            msg_rtc;

    msg_rtc = esp8266_get_message ();

    if (msg_rtc == ESP8266_CMD)
    {
        char *              parameters;
        uint_fast8_t        cmd_code;
        uint_fast8_t        var_idx;

        parameters = esp8266.u.cmd;
        cmd_code = *parameters++;

        switch (cmd_code)
        {
            case 'R':                                                   // remote procedure call: Rii
            {
                var_idx = htoi (parameters, 2);
                parameters += 2;

                switch (var_idx)
                {
                    case LDR_MIN_VALUE_RPC_VAR:
                    {
                        debug_log_message ("rpc: set LDR value as minimum");
                        ldr_set_min_value ();
                        var_send_ldr_min_value ();
                        break;
                    }

                    case LDR_MAX_VALUE_RPC_VAR:
                    {
                        debug_log_message ("rpc: set LDR value as maximum");
                        ldr_set_max_value ();
                        var_send_ldr_max_value ();
                        break;
                    }

                    case LEARN_IR_RPC_VAR:
                    {
                        debug_log_message ("rpc: learn IR codes");

                        if (remote_ir_learn ())
                        {
                            remote_ir_write_codes_to_eeprom ();
                        }
                        break;
                    }

                    case GET_NET_TIME_RPC_VAR:
                    {
                        net_time_flag = 1;
                        debug_log_message ("rpc: start net time request");
                        break;
                    }

                    case DISPLAY_TEMPERATURE_RPC_VAR:
                    {
                        show_temperature = 1;
                        debug_log_message ("rpc: show temperature");
                        break;
                    }

                    case TEST_DISPLAY_RPC_VAR:
                    {
                        debug_log_message ("rpc: start display test");
                        display_test ();
                        display_clock_flag = DISPLAY_CLOCK_FLAG_UPDATE_ALL;
                        break;
                    }

                    case GET_WEATHER_RPC_VAR:
                    {
                        weather_query (0);
                        debug_log_message ("rpc: get weather");
                        break;
                    }

