RT-CUSTOMZ/WortUhr/Software/STM32/src/main.c
                    case DISPLAY_DATE_RPC_VAR:
                    {
                        show_date = 1;
                        debug_log_message ("rpc: show date");
                        break;
                    }
                }
                break;
            }

            case 'N':                                                   // numeric variable: Niillhh
            {
                uint_fast8_t    lo;
                uint_fast8_t    hi;
                uint_fast16_t   val;

                var_idx = htoi (parameters, 2);
                parameters += 2;

                lo      = htoi (parameters, 2);
                parameters += 2;
                hi      = htoi (parameters, 2);
                parameters += 2;

                val     = (hi << 8) | lo;

                switch (var_idx)
                {
                    case EEPROM_IS_UP_NUM_VAR:
                    {
                        debug_log_printf ("cmd: set eeprom_is_up = %d, but it's readonly\r\n", val);
                        break;
                    }

                    case HARDWARE_CONFIGURATION_NUM_VAR:
                    {
                        debug_log_printf ("cmd: set hardware_configuration = %d, but it's readonly\r\n", val);
                        break;
                    }

                    case RTC_IS_UP_NUM_VAR:
                    {
                        debug_log_printf ("cmd: set rtc_is_up = %d, but it's readonly\r\n", val);
                        break;
                    }

                    case DISPLAY_POWER_NUM_VAR:
                    {
                        if (display.power_is_on != val)
                        {
                            display_clock_flag = set_power (val);
                            debug_log_printf ("cmd: set power_is_on = %d\r\n", val);
                        }
                        break;
                    }

                    case DISPLAY_AMBILIGHT_POWER_NUM_VAR:
                    {
                        if (display.ambilight_power_is_on != val)
                        {
                            display_set_ambilight_power (val);
                            debug_log_printf ("cmd: set power_is_on = %d\r\n", val);
                        }
                        break;
                    }

                    case DISPLAY_MODE_NUM_VAR:
                    {
                        if (display.display_mode != val)
                        {
                            display_set_display_mode (val, FALSE);
                            display_clock_flag = DISPLAY_CLOCK_FLAG_UPDATE_ALL;
                            debug_log_printf ("cmd: set display_mode = %d\r\n", val);
                        }
                        break;
                    }

                    case MAX_DISPLAY_MODES_NUM_VAR:
                    {
                        debug_log_printf ("cmd: set TABLE_MODDES_COUNT = %d, but it's readonly\r\n", val);
                        break;
                    }

                    case DISPLAY_BRIGHTNESS_NUM_VAR:
                    {
                        if (display.automatic_brightness)
                        {
                            last_ldr_value = 0xFF;
                            display_set_automatic_brightness (0, FALSE);
                        }
                        display_set_display_brightness (val, FALSE, TRUE);
                        display_clock_flag = DISPLAY_CLOCK_FLAG_UPDATE_NO_ANIMATION;
                        debug_log_printf ("cmd: set display_brightness = %d, disable autmomatic brightness control per LDR\r\n", val);
                        break;
                    }

                    case DISPLAY_FLAGS_NUM_VAR:
                    {
                        display_set_display_flags (val);
                        display_clock_flag = DISPLAY_CLOCK_FLAG_UPDATE_ALL;
                        debug_log_printf ("cmd: set display_flags = 0x%02x\r\n", val);
                        break;
                    }

                    case DISPLAY_AUTOMATIC_BRIGHTNESS_ACTIVE_NUM_VAR:
                    {
                        last_ldr_value = 0xFF;

                        if (val)
                        {
                            display_set_automatic_brightness (1, FALSE);
                        }
                        else
                        {
                            display_set_automatic_brightness (0, FALSE);
                        }
                        display_clock_flag = DISPLAY_CLOCK_FLAG_UPDATE_NO_ANIMATION;

                        debug_log_printf ("cmd: set automatic_brightness = %d\r\n", val);
                        break;
                    }

                    case ANIMATION_MODE_NUM_VAR:
                    {
                        if (display.animation_mode != val)
                        {
                            display_set_animation_mode (val, FALSE);
                            animation_flag = 0;
                            display_clock_flag = DISPLAY_CLOCK_FLAG_UPDATE_ALL;
                        }
                        debug_log_printf ("cmd: set animation_mode = %d\r\n", val);
                        break;
                    }

                    case AMBILIGHT_MODE_NUM_VAR:
                    {
                        if (display.ambilight_mode != val)
                        {
                            display_set_ambilight_mode (val, FALSE);
                            display_clock_flag = DISPLAY_CLOCK_FLAG_UPDATE_ALL;
                        }
                        debug_log_printf ("cmd: set ambilight_mode = %d\r\n", val);
                        break;
                    }

                    case AMBILIGHT_LEDS_NUM_VAR:
                    {
                        display_set_number_of_ambilight_leds (val);
                        debug_log_printf ("cmd: set number of ambilight leds = %d\r\n", val);
                        break;
                    }

                    case AMBILIGHT_OFFSET_NUM_VAR:
                    {
                        display_set_ambilight_led_offset (val);
                        debug_log_printf ("cmd: set ambilight led offset = %d\r\n", val);
                        break;
                    }

                    case AMBILIGHT_BRIGHTNESS_NUM_VAR:
                    {
                        display_set_ambilight_brightness (val, FALSE, TRUE);
                        display_clock_flag = DISPLAY_CLOCK_FLAG_UPDATE_NO_ANIMATION;
                        debug_log_printf ("cmd: set ambilight brightness = %d\r\n", val);
                        break;
                    }

                    case COLOR_ANIMATION_MODE_NUM_VAR:
                    {
                        if (display.color_animation_mode != val)
                        {
                            display_set_color_animation_mode (val, FALSE);
                        }
                        debug_log_printf ("cmd: set color animation_mode = %d\r\n", display.color_animation_mode);
                        break;
                    }

                    case LDR_RAW_VALUE_NUM_VAR:
                    {
                        debug_log_printf ("cmd: set ldr_raw_value = %d, but it's readonly\r\n", val);
                        break;
                    }

