RT-CUSTOMZ/WortUhr/Software/STM32/src/main.c
                    case LDR_MIN_VALUE_NUM_VAR:
                    {
                        debug_log_printf ("cmd: set ldr_min_value = %d, but it's readonly\r\n", val);
                        break;
                    }

                    case LDR_MAX_VALUE_NUM_VAR:
                    {
                        debug_log_printf ("cmd: set ldr_max_value = %d, but it's readonly\r\n", val);
                        break;
                    }

                    case TIMEZONE_NUM_VAR:
                    {
                        int_fast16_t tz = val & 0xFF;

                        if (val & 0x100)
                        {
                            tz = -tz;
                        }

                        debug_log_printf ("cmd: set timezone = %d\r\n", tz);
                        timeserver_set_timezone (tz);
                        break;
                    }

                    case DS18XX_IS_UP_NUM_VAR:
                    {
                        debug_log_printf ("cmd: set ds18xx_is_up = %d, but it's readonly\r\n", val);
                        break;
                    }

                    case RTC_TEMP_INDEX_NUM_VAR:
                    {
                        debug_log_printf ("cmd: set rtc_temp_index = %d, but it's readonly\r\n", val);
                        break;
                    }

                    case RTC_TEMP_CORRECTION_NUM_VAR:
                    {
                        rtc_set_temp_correction (val);
                        read_rtc_temperature_flag = 1;
                        debug_log_printf ("cmd: set rtc_temp_correction = %d\r\n", val);
                        break;
                    }

                    case DS18XX_TEMP_INDEX_NUM_VAR:
                    {
                        debug_log_printf ("cmd: set ds18xx_temp_index = %d, but it's readonly\r\n", val);
                        break;
                    }

                    case DS18XX_TEMP_CORRECTION_NUM_VAR:
                    {
                        temp_set_temp_correction (val);
                        measure_temperature_flag = 1;                                           // measure & read
                        read_temperature_flag = 1;
                        debug_log_printf ("cmd: set ds18xx_temp_correction = %d\r\n", val);
                        break;
                    }

                    case TICKER_DECELRATION_NUM_VAR:
                    {
                        display_set_ticker_deceleration (val);
                        debug_log_printf ("cmd: set ticker_deceleration = %d\r\n", val);
                        break;
                    }
                    case DFPLAYER_IS_UP_NUM_VAR:
                    {
                        debug_log_printf ("cmd: set TABLE_MODDES_COUNT = %d, but it's readonly\r\n", val);
                        break;
                    }
                    case DFPLAYER_VOLUME_NUM_VAR:
                    {
                        dfplayer_set_new_volume (val);
                        debug_log_printf ("cmd: set dfplayer volume = %d\r\n", val);
                        break;
                    }
                    case DFPLAYER_SILENCE_START_NUM_VAR:
                    {
                        dfplayer_set_silence_start (val);
                        debug_log_printf ("cmd: set dfplayer silence start = %d\r\n", val);
                        break;
                    }
                    case DFPLAYER_SILENCE_STOP_NUM_VAR:
                    {
                        dfplayer_set_silence_stop (val);
                        debug_log_printf ("cmd: set dfplayer silence stop = %d\r\n", val);
                        break;
                    }
                    case DFPLAYER_MODE_NUM_VAR:
                    {
                        dfplayer_set_mode (val);
                        debug_log_printf ("cmd: set dfplayer mode = %d\r\n", val);
                        break;
                    }
                    case DFPLAYER_BELL_FLAGS_NUM_VAR:
                    {
                        dfplayer_set_bell_flags (val);
                        debug_log_printf ("cmd: set dfplayer bell flags = %d\r\n", val);
                        break;
                    }
                    case DFPLAYER_SPEAK_CYCLE_NUM_VAR:
                    {
                        dfplayer_set_speak_cycle (val);
                        debug_log_printf ("cmd: set dfplayer speak cycle = %d\r\n", val);
                        break;
                    }
                    default:
                    {
                        log_printf ("cmd: set unknown num var idx %d: %d\r\n", var_idx, val);
                        break;
                    }
                    case DFPLAYER_PLAY_FOLDER_TRACK_NUM_VAR:
                    {
                        uint_fast8_t    folder;
                        uint_fast8_t    track;
                        folder = (val >> 8) & 0xFF;
                        track  = val & 0xFF;

                        dfplayer_play_folder (folder, track);
                        debug_log_printf ("cmd: play folder %d track %d\r\n", folder, track);
                        break;
                    }
                    case DISPLAY_OVERLAY_NUM_VAR:
                    {
                        show_overlay_idx = val;
                        debug_log_printf ("cmd: display overlay %d\r\n", val);
                        break;
                    }
                    case OVERLAY_N_OVERLAYS_NUM_VAR:
                    {
                        overlay_set_n_overlays (val);
                        debug_log_printf ("cmd: set number of overlays %d\r\n", val);
                        break;
                    }
                }
                break;
            }

            case 'n':                                                   // numeric array: Niinnbb
            {
                uint_fast8_t    n;
                uint_fast8_t    val;

                var_idx = htoi (parameters, 2);
                parameters += 2;

                n = htoi (parameters, 2);
                parameters += 2;

                val = htoi (parameters, 2);

