RT-CUSTOMZ/WortUhr/Software/STM32/src/main.c
                switch (var_idx)
                {
                    case DISPLAY_DIMMED_COLORS:
                    {
                        if (n < sizeof (display.dimmed_colors))
                        {
                            if (val <= MAX_BRIGHTNESS)
                            {
                                display_set_dimmed_color (n, val);
                                display_clock_flag = DISPLAY_CLOCK_FLAG_UPDATE_NO_ANIMATION;
                                debug_log_printf ("cmd: set dimmed_colors[%d] = %d\r\n", n, val);
                            }
                        }
                        else
                        {
                            debug_log_printf ("cmd: set dimmed_colors[%d] = %d, but n exceeds array size %d\r\n",
                                              sizeof (display.dimmed_colors), n, val);
                        }
                        break;
                    }
                }
                break;
            }

            case 'S':                                               // string variable: Siissssssss...
            {
                var_idx = htoi (parameters, 2);
                parameters += 2;

                switch (var_idx)
                {
                    case TICKER_TEXT_STR_VAR:
                    {
                        display_set_ticker ((unsigned char *) parameters, 1);
                        display_clock_flag = DISPLAY_CLOCK_FLAG_UPDATE_ALL;
                        debug_log_printf ("cmd: print ticker: '%s'\r\n", parameters);
                        break;
                    }

                    case VERSION_STR_VAR:
                    {
                        debug_log_printf ("cmd: set VERSION = '%s', but it's readonly\r\n", parameters);
                        break;
                    }

                    case EEPROM_VERSION_STR_VAR:
                    {
                        debug_log_printf ("cmd: set eeprom_version = '%s', but it's readonly\r\n", parameters);
                        break;
                    }

                    case ESP8266_VERSION_STR_VAR:
                    {
                        debug_log_printf ("cmd: set esp8266_version = '%s', but it's readonly\r\n", parameters);
                        break;
                    }

                    case TIMESERVER_STR_VAR:
                    {
                        timeserver_set_timeserver (parameters);
                        debug_log_printf ("cmd: set timeserver = '%s'\r\n", parameters);
                        break;
                    }

                    case WEATHER_APPID_STR_VAR:
                    {
                        weather_set_appid (parameters);
                        debug_log_printf ("cmd: set weather appid = '%s'\r\n", parameters);
                        break;
                    }

                    case WEATHER_CITY_STR_VAR:
                    {
                        weather_set_city (parameters);
                        debug_log_printf ("cmd: set weather city = '%s'\r\n", parameters);
                        break;
                    }

                    case WEATHER_LON_STR_VAR:
                    {
                        weather_set_lon (parameters);
                        debug_log_printf ("cmd: set weather lon = '%s'\r\n", parameters);
                        break;
                    }

                    case WEATHER_LAT_STR_VAR:
                    {
                        weather_set_lat (parameters);
                        debug_log_printf ("cmd: set weather lat = '%s'\r\n", parameters);
                        break;
                    }

                    case UPDATE_HOST_VAR:
                    {
                        strncpy (gmain.update_host, parameters, EEPROM_MAX_HOSTNAME_LEN - 1);
                        write_update_host_to_eeprom ();
                        debug_log_printf ("cmd: set update host = '%s'\r\n", parameters);
                        break;
                    }

                    case UPDATE_PATH_VAR:
                    {
                        strncpy (gmain.update_path, parameters, EEPROM_MAX_UPDATE_PATH_LEN - 1);
                        write_update_path_to_eeprom ();
                        debug_log_printf ("cmd: set update path = '%s'\r\n", parameters);
                        break;
                    }
                }
                break;
            }

            case 'T':
            {
                var_idx = htoi (parameters, 2);
                parameters += 2;

                switch (var_idx)
                {
                    case CURRENT_TM_VAR:
                    {
                        // struct tm tmtemp;
                        gmain.tm.tm_year = 1000 * (parameters[0]  - '0') +
                                            100 * (parameters[1]  - '0') +
                                             10 * (parameters[2]  - '0') +
                                              1 * (parameters[3]  - '0');
                        gmain.tm.tm_mon  =   10 * (parameters[4]  - '0') +
                                              1 * (parameters[5]  - '0');
                        gmain.tm.tm_mday =   10 * (parameters[6]  - '0') +
                                              1 * (parameters[7]  - '0');
                        gmain.tm.tm_hour =   10 * (parameters[8]  - '0') +
                                              1 * (parameters[9]  - '0');
                        gmain.tm.tm_min  =   10 * (parameters[10] - '0') +
                                              1 * (parameters[11] - '0');
                        gmain.tm.tm_sec =    10 * (parameters[12] - '0') +
                                              1 * (parameters[13] - '0');

                        gmain.tm.tm_wday = dayofweek (gmain.tm.tm_mday, gmain.tm.tm_mon + 1, gmain.tm.tm_year + 1900);

                        if (grtc.rtc_is_up)
                        {
                            rtc_set_date_time (&(gmain.tm));
                        }

                        if (hour != (uint_fast8_t) gmain.tm.tm_hour || minute != (uint_fast8_t) gmain.tm.tm_min)
                        {
                            display_clock_flag = DISPLAY_CLOCK_FLAG_UPDATE_ALL;
                        }

                        year    = gmain.tm.tm_year + 1900;
                        month   = gmain.tm.tm_mon  + 1;
                        mday    = gmain.tm.tm_mday;
                        wday    = gmain.tm.tm_wday;
                        hour    = gmain.tm.tm_hour;
                        minute  = gmain.tm.tm_min;
                        second  = gmain.tm.tm_sec;

