RT-CUSTOMZ/WortUhr/Software/STM32/src/main.c
                        debug_log_printf ("cmd: set time = %s %4d-%02d-%02d %02d:%02d:%02d\r\n",
                                            wdays_en[gmain.tm.tm_wday], gmain.tm.tm_year + 1900, gmain.tm.tm_mon + 1, gmain.tm.tm_mday,
                                            gmain.tm.tm_hour, gmain.tm.tm_min, gmain.tm.tm_sec);
                        break;
                    }
                }
                break;
            }

            case 'D':                                               // display Dxii...
            {
                cmd_code = *parameters++;
                var_idx = htoi (parameters, 2);
                parameters += 2;

                switch (cmd_code)
                {
                    case 'N':                                       // DN: Display mode Name
                    {
                        debug_log_printf ("cmd: set display_mode_name[%d] = '%s', but it's readonly\r\n", var_idx, parameters);
                        break;
                    }

                    case 'C':                                       // DC: Display Color
                    {
                        DSP_COLORS rgb;

                        rgb.red = htoi (parameters, 2);
                        parameters += 2;
                        rgb.green = htoi (parameters, 2);
                        parameters += 2;
                        rgb.blue = htoi (parameters, 2);
                        parameters += 2;
#if DSP_USE_SK6812_RGBW == 1
                        rgb.white = htoi (parameters, 2);
                        parameters += 2;
#endif

                        if (var_idx == DISPLAY_DSP_COLOR_VAR)
                        {
                            display_set_display_colors (&(rgb));
#if DSP_USE_SK6812_RGBW == 1
                            debug_log_printf ("cmd: set display_colors = %d %d %d %d\r\n", rgb.red, rgb.green, rgb.blue, rgb.white);
#else
                            debug_log_printf ("cmd: set display_colors = %d %d %d\r\n", rgb.red, rgb.green, rgb.blue);
#endif
                        }
                        else if (var_idx == AMBILIGHT_DSP_COLOR_VAR)
                        {
                            display_set_ambilight_colors (&(rgb));
#if DSP_USE_SK6812_RGBW == 1
                            debug_log_printf ("cmd: set ambilight_colors = %d %d %d %d\r\n", rgb.red, rgb.green, rgb.blue, rgb.white);
#else
                            debug_log_printf ("cmd: set ambilight_colors = %d %d %d\r\n", rgb.red, rgb.green, rgb.blue);
#endif
                        }
                        else
                        {
                            debug_log_printf ("DC: invalid var_idx: %d\r\n", var_idx);
                        }
                        break;
                    }
                }
                break;
            }

            case 'A':                                                               // animation
            {
                cmd_code = *parameters++;
                var_idx = htoi (parameters, 2);
                parameters += 2;

                switch (cmd_code)
                {
                    case 'N':                                                       // AN: Animation mode Name
                    {
                        debug_log_printf ("cmd: set animation_mode_name[%d] = '%s', but it's readonly\r\n", var_idx, parameters);
                        break;
                    }

                    case 'D':                                                       // AD: Animation Deceleration
                    {
                        uint_fast8_t deceleration = htoi (parameters, 2);
                        parameters += 2;
                        display_set_animation_deceleration (var_idx, deceleration);
                        debug_log_printf ("cmd: set animation_deceleration[%d] = %d\r\n", var_idx, deceleration);
                        break;
                    }

                    case 'E':                                                       // AE: Animation default deceleration
                    {
                        debug_log_message ("cmd: set animation_default_deceleration, but it's readonly\r\n");
                        break;
                    }

                    case 'F':                                                       // AF: Animation Flags
                    {
                        uint_fast8_t flags = htoi (parameters, 2);
                        parameters += 2;
                        display_set_animation_flags (var_idx, flags);
                        debug_log_printf ("cmd: set animation_flags[%d] = 0x%02x\r\n", var_idx, flags);
                        break;
                    }
                }
                break;
            }

            case 'C':                                                               // Color animation
            {
                cmd_code = *parameters++;
                var_idx = htoi (parameters, 2);
                parameters += 2;

                switch (cmd_code)
                {
                    case 'N':                                                       // CNiis: Color animation Name
                    {
                        debug_log_printf ("cmd: set color_animation_name[%d] = '%s', but it's readonly\r\n", var_idx, parameters);
                        break;
                    }

                    case 'D':                                                       // CDiid: Color animation Deceleration
                    {
                        uint_fast8_t deceleration = htoi (parameters, 2);
                        parameters += 2;
                        display_set_color_animation_deceleration (var_idx, deceleration);
                        debug_log_printf ("cmd: set color_animation_deceleration[%d] = %d\r\n", var_idx, deceleration);
                        break;
                    }

                    case 'E':                                                       // CEiid: Color animation default deceleration
                    {
                        debug_log_message ("cmd: set color_animation_default_deceleration, but it's readonly\r\n");
                        break;
                    }

                    case 'F':                                                       // CFiif: Color animation Flags
                    {
                        debug_log_message ("cmd: set color_animation_flags, but it's readonly");
                        break;
                    }
                }
                break;
            }

            case 'M':                                                               // Ambilight mode
            {
                cmd_code = *parameters++;
                var_idx = htoi (parameters, 2);
                parameters += 2;

