RT-CUSTOMZ/WortUhr/Software/STM32/src/main.c
                switch (cmd_code)
                {
                    case 'N':                                                       // MN: Ambilight mode Name
                    {
                        debug_log_printf ("cmd: set ambilight_mode_name[%d] = '%s', but it's readonly", var_idx, parameters);
                        break;
                    }

                    case 'D':                                                       // MD: Ambilight mode Deceleration
                    {
                        uint_fast8_t deceleration = htoi (parameters, 2);
                        parameters += 2;
                        display_set_ambilight_mode_deceleration (var_idx, deceleration);
                        debug_log_printf ("cmd: set ambilight_mode_deceleration[%d] = %d\r\n", var_idx, deceleration);
                        break;
                    }

                    case 'E':                                                       // ME: Ambilight mode default deceleration
                    {
                        debug_log_message ("cmd: set ambilight_mode_default_deceleration, but it's readonly\r\n");
                        break;
                    }

                    case 'F':                                                       // MF: Ambilight mode Flags
                    {
                        uint_fast8_t flags = htoi (parameters, 2);
                        parameters += 2;
                        display_set_ambilight_mode_flags (var_idx, flags);
                        debug_log_printf ("cmd: set ambilight_mode_flags[%d] = %d\r\n", var_idx, flags);
                        break;
                    }
                }
                break;
            }

            case 'O':                                                               // Overlay
            {
                cmd_code = *parameters++;
                var_idx = htoi (parameters, 2);
                parameters += 2;

                switch (cmd_code)
                {
                    case 'T':                                                       // OT: Overlay Type
                    {
                        uint_fast8_t type = htoi (parameters, 2);
                        parameters += 2;
                        overlay_set_type (var_idx, type);
                        debug_log_printf ("cmd: set overlay type[%d] = %d\r\n", var_idx, type);
                        break;
                    }

                    case 'I':                                                       // OI: Overlay Interval
                    {
                        uint_fast8_t interval = htoi (parameters, 2);
                        parameters += 2;
                        overlay_set_interval (var_idx, interval);
                        debug_log_printf ("cmd: set overlay interval[%d] = %d\r\n", var_idx, interval);
                        break;
                    }

                    case 'D':                                                       // OD: Overlay Duration
                    {
                        uint_fast8_t duration = htoi (parameters, 2);
                        parameters += 2;
                        overlay_set_duration (var_idx, duration);
                        debug_log_printf ("cmd: set overlay duration[%d] = %d\r\n", var_idx, duration);
                        break;
                    }

                    case 'C':                                                       // OD: Overlay Date Code
                    {
                        uint_fast8_t date_code = htoi (parameters, 2);
                        parameters += 2;
                        overlay_set_date_code (var_idx, date_code);
                        debug_log_printf ("cmd: set overlay date code[%d] = %d\r\n", var_idx, date_code);
                        break;
                    }

                    case 'S':                                                       // OS: Overlay date start
                    {
                        uint_fast16_t date_start = htoi (parameters, 4);
                        overlay_set_date_start (var_idx, date_start);
                        debug_log_printf ("cmd: set overlay date start[%d] = %02d-%02d\r\n", var_idx, date_start >> 8, date_start & 0xFF);
                        break;
                    }

                    case 'Y':                                                       // OY: Overlay days
                    {
                        uint_fast8_t days = htoi (parameters, 2);
                        overlay_set_days (var_idx, days);
                        debug_log_printf ("cmd: set overlay days[%d] = %d\r\n", var_idx, days);

                        break;
                    }

                    case 'N':                                                       // ON: Overlay name or text
                    {
                        overlay_set_text (var_idx, parameters);
                        debug_log_printf ("cmd: set overlay text[%d] = %s\r\n", var_idx, parameters);
                        break;
                    }

                    case 'F':                                                       // OF: Overlay flags
                    {
                        uint_fast8_t flags = htoi (parameters, 2);
                        parameters += 2;
                        overlay_set_flags (var_idx, flags);
                        overlay_calc_dates (var_idx, year);
                        debug_log_printf ("cmd: set overlay flags[%d] = %d\r\n", var_idx, flags);
                        break;
                    }
                }
                break;
            }

            case 't':                                                               // tiimmff night table minutes + flags
            {
                uint_fast16_t minutes;
                uint_fast8_t flags;

                var_idx = htoi (parameters, 2);
                parameters += 2;
                minutes = htoi (parameters, 2) + (htoi (parameters + 2, 2) << 8);
                parameters += 4;
                flags = htoi (parameters, 2);
                parameters += 2;

                night_time[var_idx].minutes = minutes;
                night_time[var_idx].flags = flags;
                night_write_data_to_eeprom ();
                debug_log_printf ("cmd: set night_time[%d]: minutes = %d, flags = 0x%02x\r\n", var_idx, minutes, flags);
                break;
            }

            case 'a':                                                               // aiimmff night table minutes + flags
            {
                uint_fast16_t minutes;
                uint_fast8_t flags;

                var_idx = htoi (parameters, 2);
                parameters += 2;
                minutes = htoi (parameters, 2) + (htoi (parameters + 2, 2) << 8);
                parameters += 4;
                flags = htoi (parameters, 2);
                parameters += 2;

                ambilight_night_time[var_idx].minutes = minutes;
                ambilight_night_time[var_idx].flags = flags;
                night_write_data_to_eeprom ();
                debug_log_printf ("cmd: set ambilight night_time[%d]: minutes = %d, flags = 0x%02x\r\n", var_idx, minutes, flags);
                break;
            }

            case 'l':                                                               // liimmff alarm table minutes + flags
            {
                uint_fast16_t minutes;
                uint_fast8_t flags;

                var_idx = htoi (parameters, 2);
                parameters += 2;
                minutes = htoi (parameters, 2) + (htoi (parameters + 2, 2) << 8);
                parameters += 4;
                flags = htoi (parameters, 2);
                parameters += 2;

                alarm_time[var_idx].minutes = minutes;
                alarm_time[var_idx].flags = flags;
                alarm_write_data_to_eeprom ();
                debug_log_printf ("cmd: set alarm_time[%d]: minutes = %d, flags = 0x%02x\r\n", var_idx, minutes, flags);
                break;
            }

