RT-CUSTOMZ/WortUhr/Software/STM32/src/main.c
            case 'G':                                                               // Gx Games
            {
                switch (*parameters++)
                {
                    case 'T':
                    {
                        if (*parameters == 's')
                        {
                            tetris ();                                              // GTs: Start Tetris
                            display_clock_flag = DISPLAY_CLOCK_FLAG_UPDATE_ALL;
                        }
                    }
                }
                break;
            }
        }
    }
    else if (msg_rtc == ESP8266_TIME)
    {
        char *          endptr;
        uint32_t        seconds_since_1900;

        seconds_since_1900  = strtoul (esp8266.u.time, &endptr, 10);
        timeserver_convert_time (&gmain.tm, seconds_since_1900);

        if (grtc.rtc_is_up)
        {
            rtc_set_date_time (&gmain.tm);
        }

        if (hour != (uint_fast8_t) gmain.tm.tm_hour || minute != (uint_fast8_t) gmain.tm.tm_min)
        {
            var_send_tm ();
            display_clock_flag = DISPLAY_CLOCK_FLAG_UPDATE_ALL;
        }

        year    = gmain.tm.tm_year + 1900;
        month   = gmain.tm.tm_mon  + 1;
        mday    = gmain.tm.tm_mday;
        wday    = gmain.tm.tm_wday;
        hour    = gmain.tm.tm_hour;
        minute  = gmain.tm.tm_min;
        second  = gmain.tm.tm_sec;

        debug_log_printf ("cmd: set time to %s %4d-%02d-%02d %02d:%02d:%02d\r\n",
                            wdays_en[gmain.tm.tm_wday], gmain.tm.tm_year + 1900, gmain.tm.tm_mon + 1, gmain.tm.tm_mday,
                            gmain.tm.tm_hour, gmain.tm.tm_min, gmain.tm.tm_sec);
        net_time_countdown = 3600 + 180 + 40 - second;                      // calc next timeserver call 1h3m later at hh:mm:40
    }
    else if (msg_rtc == ESP8266_IPADDRESS)                                  // ESP8266 got new ip address
    {
        unsigned char buf[32];

        sprintf ((char *) buf, "IP %s", esp8266.ipaddress);
        log_printf ("info: ip address = %s\r\n", esp8266.ipaddress);
        log_flush ();
        var_send_all_variables ();
        debug_log_message ("info: configuration sent");
        log_flush ();
        display_set_ticker (buf, 1);
        display_clock_flag = DISPLAY_CLOCK_FLAG_UPDATE_ALL;
    }
    else if (msg_rtc == ESP8266_ACCESSPOINT)
    {
        debug_log_message ("info: got ESP8266_ACCESSPOINT");
    }
    else if (msg_rtc == ESP8266_MODE)
    {
        if (esp8266.mode == ESP8266_AP_MODE)
        {
            debug_log_message ("info: got ESP8266_AP_MODE");
        }
        else if (esp8266.mode == ESP8266_CLIENT_MODE)
        {
            debug_log_message ("info: got ESP8266_CLIENT_MODE");
        }
        else
        {
            debug_log_message ("info: got invalid ESP8266 mode");
        }
    }
    else if (msg_rtc == ESP8266_FIRMWARE)
    {
        debug_log_message ("info: got ESP8266_FIRMWARE");
    }
    else if (msg_rtc == ESP8266_WEATHER)
    {
        log_printf ("info: weather = %s\r\n", esp8266.u.weather);
        display_set_ticker ((unsigned char *) esp8266.u.weather, 1);
        display_clock_flag = DISPLAY_CLOCK_FLAG_UPDATE_ALL;
    }
    else if (msg_rtc == ESP8266_WEATHER_ICON)
    {
        char tmpbuf[3];         // we must copy esp8266.u.weather, because union is used by icon transfer
        tmpbuf[0] = esp8266.u.weather[0];
        tmpbuf[1] = esp8266.u.weather[1];
        tmpbuf[2] = '\0';
        log_printf ("info: weather icon %s\r\n", tmpbuf);
        display_get_weather_icon (tmpbuf, icon_duration);
    }
    else if (msg_rtc == ESP8266_ICONDATA)
    {
        if (display_read_icon () == 2)                                                          // icon read succefully
        {
            display.do_display_icon = 1;
            show_icon_stop_time = local_uptime + icon_duration;                                 // stop in x seconds
        }
    }
    else if (msg_rtc == ESP8266_OK)
    {
        var_send_busy = 0;
    }
#if 0 // yet not used
    else if (msg_rtc == ESP8266_FILEOPEN)
    {
        ;
    }
    else if (msg_rtc == ESP8266_FILEDATA)
    {
        ;
    }
    else if (msg_rtc == ESP8266_FILECLOSE)
    {
        ;
    }
#endif

    return msg_rtc;
}

static uint_fast8_t
do_play_dfplayer (uint_fast16_t cur_minute)
{
    uint_fast8_t    do_play = 0;

    if (dfplayer.silence_start < dfplayer.silence_stop)         // e.g. 08:00 - 11:00
    {
        if (cur_minute < dfplayer.silence_start || cur_minute > dfplayer.silence_stop)
        {
            do_play = 1;
        }
    }
    else if (dfplayer.silence_start > dfplayer.silence_stop)    // e.g. 22:00 - 06:00
    {
        if (cur_minute > dfplayer.silence_stop && cur_minute < dfplayer.silence_start)
        {
            do_play = 1;
        }
    }
    else                                                        // e.g. 00:00 - 00:00
    {
        do_play = 1;
    }

    return do_play;
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * main function
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
int
main (void)
{
    static uint_fast16_t    last_ldr_raw_value          = 0xFFFF;
    uint_fast8_t            esp8266_is_up               = 0;
    IRMP_DATA               irmp_data;
    uint32_t                stop_time;
    uint_fast8_t            cmd;
    uint_fast8_t            status_led_cnt              = 0;
    uint_fast8_t            time_changed                = 0;
    uint_fast16_t           ldr_raw_value;
    uint_fast8_t            ldr_value;
    uint32_t                ap_pressed                  = 0;
    uint32_t                wps_pressed                 = 0;                // timestamp when wps button has been pressed
    uint32_t                clockspeed                  = 100000;           // default clock speed for i2c bus
    uint_fast8_t            ds18xx_temperature_index    = 0xFF;
    uint_fast8_t            rtc_temperature_index       = 0xFF;

    SystemInit ();
    SystemCoreClockUpdate();                                                // needed for Nucleo board

#if defined (STM32F103)                                                     // disable JTAG to get back PB3, PB4, PA13, PA14, PA15
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);                    // turn on clock for the alternate function register
    GPIO_PinRemapConfig(GPIO_Remap_SWJ_JTAGDisable, ENABLE);                // disable the JTAG, enable the SWJ interface
#endif

    gmain.hardware_configuration = 0;
#if defined (STM32F103)
    gmain.hardware_configuration |= HW_STM32_F103;
#elif defined (STM32F401RE)
    gmain.hardware_configuration |= HW_STM32_F401;
#elif defined (STM32F411RE)
    gmain.hardware_configuration |= HW_STM32_F411;
#elif defined (STM32F446RE)
    gmain.hardware_configuration |= HW_STM32_F446;
#else
# error unknown STM32 hardware
#endif

#if WCLOCK24H == 1
    gmain.hardware_configuration |= HW_WC_24H;
#else
    gmain.hardware_configuration |= HW_WC_12H;
#endif

