RT-CUSTOMZ/WortUhr/Software/STM32/src/main.c
#if DSP_USE_WS2812_GRB == 1
    gmain.hardware_configuration |= HW_LED_WS2812_GRB_LED;
#elif DSP_USE_WS2812_RGB == 1
    gmain.hardware_configuration |= HW_LED_WS2812_RGB_LED;
#elif DSP_USE_APA102 == 1
    gmain.hardware_configuration |= HW_LED_APA102_RGB_LED;
#elif DSP_USE_SK6812_RGB == 1
    gmain.hardware_configuration |= HW_LED_SK6812_RGB_LED;
#elif DSP_USE_SK6812_RGBW == 1
    gmain.hardware_configuration |= HW_LED_SK6812_RGBW_LED;
#else
# error unknown LED type
#endif

    strcpy (gmain.update_host, DEFAULT_UPDATE_HOST);
    strcpy (gmain.update_path, DEFAULT_UPDATE_PATH);

    log_init (115200);                                                      // initilize logger on uart
    irmp_init ();                                                           // initialize IRMP
    power_init ();                                                          // initialize power port pin
    power_on ();                                                            // switch power on
    delay_init (DELAY_RESOLUTION_5_US);                                     // initialize delay functions with granularity of 5 us
    board_led_init ();                                                      // initialize GPIO for board LED
    button_init ();                                                         // initialize GPIO for user button

    if (button_pressed ())                                                  // set ESP8266 into flash mode
    {
        board_led_on ();
        esp8266_flash ();
    }

    timer2_init ();                                                         // initialize timer2 for IRMP, DCF77, EEPROM etc.
    wpsbutton_init ();                                                      // initialize GPIO for WPS button

    log_message ("\r\nWelcome to WordClock Logger!");
    log_message ("----------------------------");
    log_puts ("Version: ");
    log_message (VERSION);

    rtc_init (clockspeed);                                                  // initialize I2C RTC
    eeprom_init (clockspeed);                                               // initialize I2C EEPROM

    if (grtc.rtc_is_up)
    {
        log_message ("rtc is online");
    }
    else
    {
        log_message ("rtc is offline");
    }

    if (eeprom_is_up)
    {
        log_message ("eeprom is online");
    }
    else
    {
        log_message ("eeprom is offline");
    }

    if (! grtc.rtc_is_up || ! eeprom_is_up)
    {
        log_message ("trying to reduce I2C clock speed...");
        clockspeed /= 2;

        rtc_init (clockspeed);                                              // initialize I2C RTC again
        eeprom_init (clockspeed);                                           // initialize I2C EEPROM again

        if (grtc.rtc_is_up)
        {
            log_message ("rtc is now online");
        }
        else
        {
            log_message ("rtc remains offline");
        }

        if (eeprom_is_up)
        {
            log_message ("eeprom is now online");
        }
        else
        {
            log_message ("eeprom remains offine");
        }
    }

    display_init ();                                                        // initialize display
    overlay_init ();                                                        // initialize overlays

    read_configuration_from_eeprom ();

    ldr_init ();                                                            // initialize LDR (ADC)
    dcf77_init ();                                                          // initialize DCF77
    night_init ();                                                          // initialize night time routines
    alarm_init ();                                                          // initialize alarm routines
    temp_init ();                                                           // initialize DS18xx
    dfplayer_init ();

    display_reset_led_states ();

    upgrade_eeprom_version ();

    ds3231_flag = 1;

    stop_time = uptime + 3;                                                 // wait 3 seconds for IR signal...
    display_set_status_or_minute_leds (1, 1, 1);                            // show white status or minute LEDs

    while (uptime < stop_time)
    {
        if (irmp_get_data (&irmp_data))                                     // got IR signal?
        {
            display_set_status_led (1, 0, 0);                               // yes, show red status LED
            delay_sec (1);                                                  // and wait 1 second
            (void) irmp_get_data (&irmp_data);                              // flush input of IRMP now
            display_set_status_led (0, 0, 0);                               // and switch status LED off

            debug_log_message ("calling IR learn function");
            if (remote_ir_learn ())                                         // learn IR commands
            {
                remote_ir_write_codes_to_eeprom ();                         // if successful, save them in EEPROM
            }
            break;                                                          // and break the loop
        }
    }

    display_set_status_or_minute_leds (0, 0, 0);                            // switch off status or minute LEDs

    esp8266_init ();

    if (ds18xx.is_up)
    {
        temp_read_temp_index ();
    }

    if (grtc.rtc_is_up)
    {
        rtc_get_temperature_index ();
    }

    while (1)
    {
        local_uptime = uptime;                                                          // cache volatile variable in local variable

        if (esp8266_is_up)                                                              // if user pressed user button, set ESP8266 to AP mode
        {
            if (local_uptime - ap_pressed > 5 && button_pressed ())
            {
                ap_pressed = local_uptime;                                              // debounce here
                log_message ("user button pressed: configuring esp8266 as access point");
                esp8266.is_online = 0;
                esp8266.ipaddress[0] = '\0';
                esp8266_accesspoint ("wordclock", "1234567890");
            }
            else if (local_uptime - wps_pressed > 5 && wpsbutton_pressed ())            // if user pressed wps button, send WPS command to ESP8266
            {
                wps_pressed = local_uptime;                                             // debounce here
                log_message ("wps button pressed: sending esp8266 wps command");
                esp8266.is_online = 0;
                esp8266.ipaddress[0] = '\0';
                esp8266_wps ();
            }
        }

