RT-CUSTOMZ/WortUhr/Software/STM32/src/main.c
        if (status_led_cnt)
        {
            status_led_cnt--;

            if (! status_led_cnt)
            {
                display_set_status_led (0, 0, 0);
            }
        }

        schedule_esp8266_messages ();

        if (display.animation_stop_flag && ! display.do_display_icon && display.automatic_brightness && ldr_poll_brightness ())
        {
            ldr_raw_value = ldr.ldr_raw_value;

            if (ldr_raw_value + 16 < last_ldr_raw_value || ldr_raw_value > last_ldr_raw_value + 16)         // difference greater than 16
            {
                debug_log_printf ("ldr: old raw brightnes: %d new raw brightness: %d\r\n", last_ldr_raw_value, ldr_raw_value);
                last_ldr_raw_value = ldr_raw_value;

                if (esp8266.is_online)
                {
                    var_send_ldr_raw_value ();
                }
            }

            ldr_value = ldr.ldr_value;                                                                      // ldr_value is 0...31

            if (ldr_value + 1 < last_ldr_value || ldr_value > last_ldr_value + 1)                           // difference greater than 2
            {
                last_ldr_value = ldr_value;                                                                 // store value 0...31
                ldr_value /= 2;                                                                             // set ldr_value to 0...15
                debug_log_printf ("ldr: old brightnes: %d new brightness: %d\r\n", last_ldr_value / 2, ldr_value);
                display_set_display_brightness (ldr_value, FALSE, FALSE);
                display_clock_flag = DISPLAY_CLOCK_FLAG_UPDATE_NO_ANIMATION;
            }
        }

        if (!esp8266_is_up)                                                 // esp8266 up yet?
        {
            if (esp8266.is_up)
            {
                esp8266_is_up = 1;
                log_message ("esp8266 now up");
            }
        }
        else
        {                                                                   // esp8266 is up...
            if (! esp8266_is_online)                                        // but not online yet...
            {
                if (esp8266.is_online)                                      // now online?
                {
                    esp8266_is_online = 1;
                    log_message ("esp8266 now online");
                    net_time_flag = 1;
                }
            }
        }

        if (dcf77_time(&gmain.tm))
        {
            display_set_status_led (1, 1, 0);                               // got DCF77 time, light yellow = green + red LED

            status_led_cnt = 50;

            if (grtc.rtc_is_up)
            {
                rtc_set_date_time (&gmain.tm);
            }

            if (hour != (uint_fast8_t) gmain.tm.tm_hour || minute != (uint_fast8_t) gmain.tm.tm_min)
            {
                if (esp8266.is_online)
                {
                    var_send_tm ();
                }
                display_clock_flag = DISPLAY_CLOCK_FLAG_UPDATE_ALL;
            }

            year    = gmain.tm.tm_year + 1900;
            month   = gmain.tm.tm_mon  + 1;
            mday    = gmain.tm.tm_mday;
            wday    = gmain.tm.tm_wday;
            hour    = gmain.tm.tm_hour;
            minute  = gmain.tm.tm_min;
            second  = gmain.tm.tm_sec;

            log_printf ("dcf77: %s %4d-%02d-%02d %02d:%02d:%02d\r\n",
                         wdays_en[gmain.tm.tm_wday], gmain.tm.tm_year + 1900, gmain.tm.tm_mon + 1, gmain.tm.tm_mday,
                         gmain.tm.tm_hour, gmain.tm.tm_min, gmain.tm.tm_sec);
        }

        if (ds3231_flag)
        {
            if (grtc.rtc_is_up && rtc_get_date_time (&gmain.tm))
            {
                if (hour != (uint_fast8_t) gmain.tm.tm_hour || minute != (uint_fast8_t) gmain.tm.tm_min)
                {
                    display_clock_flag = DISPLAY_CLOCK_FLAG_UPDATE_ALL;
                }

                year    = gmain.tm.tm_year + 1900;
                month   = gmain.tm.tm_mon  + 1;
                mday    = gmain.tm.tm_mday;
                wday    = gmain.tm.tm_wday;
                hour    = gmain.tm.tm_hour;
                minute  = gmain.tm.tm_min;
                second  = gmain.tm.tm_sec;

                log_printf ("read rtc: %s %4d-%02d-%02d %02d:%02d:%02d\r\n",
                            wdays_en[gmain.tm.tm_wday], gmain.tm.tm_year + 1900, gmain.tm.tm_mon + 1, gmain.tm.tm_mday,
                            gmain.tm.tm_hour, gmain.tm.tm_min, gmain.tm.tm_sec);
            }

            ds3231_flag = 0;
        }

        if (display.animation_stop_flag && ! display.do_display_icon && display.automatic_brightness && ldr_conversion_flag)
        {
            ldr_start_conversion ();
            ldr_conversion_flag = 0;
        }

        if (net_time_flag)
        {
            if (esp8266.is_online)
            {
                display_set_status_led (0, 0, 1);                           // light blue status LED
                status_led_cnt = STATUS_LED_FLASH_TIME;
                timeserver_start_timeserver_request ();                     // start a timeserver request, answer follows...
            }

            net_time_flag = 0;
            net_time_countdown = 3800;                                      // next net time after 3800 sec
        }

        if (show_time_flag)                                                 // set every full minute
        {
            show_time_flag = 0;

            gmain.tm.tm_year = year - 1900;
            gmain.tm.tm_mon  = month - 1;
            gmain.tm.tm_mday = mday;
            gmain.tm.tm_hour = hour;
            gmain.tm.tm_min  = minute;
            gmain.tm.tm_sec  = second;
            gmain.tm.tm_wday = wday;

            if (esp8266.is_online)
            {
                var_send_tm ();
            }

            // display_clock_flag = 0;                                      // don't reset flag

            if (night_check_night_times (0, display.power_is_on, wday, hour * 60 + minute))
            {
                display_clock_flag = toggle_power (TRUE);
                log_printf ("Found Timer: %s at %02d:%02d\r\n", display.power_is_on ? "on" : "off", hour, minute);
            }

            if (night_check_night_times (1, display.ambilight_power_is_on, wday, hour * 60 + minute))
            {
                display_set_ambilight_power (! display.ambilight_power_is_on);
                log_printf ("Found Timer: ambilight %s at %02d:%02d\r\n", display.ambilight_power_is_on ? "on" : "off", hour, minute);
            }

            if (display_clock_flag == 0)                                // no night time found
            {
#if WCLOCK24H == 1
                display_clock_flag = DISPLAY_CLOCK_FLAG_UPDATE_ALL;
#else
                if (minute % 5)
                {
                    display_clock_flag = DISPLAY_CLOCK_FLAG_UPDATE_MINUTES; // only update minute LEDs
                }
                else
                {
                    display_clock_flag = DISPLAY_CLOCK_FLAG_UPDATE_ALL;
                }
#endif
            }
        }

        if (half_minute_flag)
        {
            half_minute_flag = 0;

            if (net_time_countdown > 3800 - 30)         // waiting for timeserver response?
            {                                           // no, else don't communicate with ESP8266 (icon vs. timeserver response)
                log_printf ("net_time_countdown = %d, don't check overlays\r\n", net_time_countdown);
            }
            else
            {
                static uint_fast16_t    last_year;
                uint_fast16_t           mmdd;
                uint_fast8_t            overlay_idx;
                uint_fast8_t            overlay_max_interval;

