RT-CUSTOMZ/WortUhr/Software/STM32/src/main.c
                mmdd                    = (month << 8) + mday;
                overlay_max_interval    = 0;

                if (last_year != year)
                {
                    uint_fast8_t    i;

                    last_year = year;

                    for (i = 0; i < overlay.n_overlays; i++)
                    {
                        overlay_calc_dates (i, last_year);
                    }
                }

                // overlay step 1: find maximum overlay interval which matches current minute
                // overlays with matching dates have higher priority
                for (overlay_idx = 0; overlay_idx < overlay.n_overlays; overlay_idx++)
                {
                    if (overlay.overlays[overlay_idx].flags & OVERLAY_FLAG_ACTIVE)
                    {
                        if ((minute % overlay.overlays[overlay_idx].interval) == 0)
                        {
                            if (overlay.overlays[overlay_idx].date_start == 0 ||
                                (mmdd >= overlay.overlays[overlay_idx].date_start && mmdd <= overlay.overlays[overlay_idx].date_end))
                            {
                                if (overlay.overlays[overlay_idx].interval > overlay_max_interval)
                                {
                                    overlay_max_interval = overlay.overlays[overlay_idx].interval;
                                    show_overlay_idx = overlay_idx;
                                }
                                else if (overlay.overlays[overlay_idx].interval == overlay_max_interval)
                                {
                                    if (overlay.overlays[overlay_idx].date_start != 0)
                                    {
                                        overlay_max_interval = overlay.overlays[overlay_idx].interval;
                                        show_overlay_idx = overlay_idx;
                                    }

                                }
                            }
                        }
                    }
                }
            }
        }

        if (measure_temperature_flag)
        {
            measure_temperature_flag = 0;

            if (ds18xx.is_up)
            {
                temp_start_conversion (read_temperature_flag);          // start conversion, wait if read_temperature_flag is also set
            }
        }

        if (read_temperature_flag)
        {
            read_temperature_flag = 0;

            if (ds18xx.is_up)
            {
                ds18xx_temperature_index = temp_read_temp_index ();
                log_printf ("DS18xxx temperature: %d%s\r\n", ds18xx_temperature_index / 2, (ds18xx_temperature_index % 2) ? ".5" : "");

                if (esp8266.is_online)
                {
                    var_send_ds18xx_temp_index ();
                }
            }
            else
            {
                ds18xx_temperature_index = 0xFF;
            }
        }

        if (read_rtc_temperature_flag)
        {
            read_rtc_temperature_flag = 0;

            if (grtc.rtc_is_up)
            {
                rtc_temperature_index = rtc_get_temperature_index ();
                log_printf ("RTC temperature: %d%s\r\n", rtc_temperature_index / 2, (rtc_temperature_index % 2) ? ".5" : "");

                if (esp8266.is_online)
                {
                    var_send_rtc_temp_index ();
                }
            }
            else
            {
                rtc_temperature_index = 0xFF;
            }
        }

        if (show_overlay_idx != 0xFF)                                                                       // overlay to show?
        {
            switch (overlay.overlays[show_overlay_idx].type)
            {
                case OVERLAY_TYPE_ICON:                                                                     // icon
                {
                    log_printf ("overlay icon %s\r\n", overlay.overlays[show_overlay_idx].text);
                    display_get_icon (overlay.overlays[show_overlay_idx].text, overlay.overlays[show_overlay_idx].duration);
                    icon_duration = overlay.overlays[show_overlay_idx].duration;
                    break;
                }
                case OVERLAY_TYPE_DATE:                                                                     // date
                {
                    show_date = 1;
                    log_message ("overlay date");
                    break;
                }
                case OVERLAY_TYPE_TEMPERATURE:                                                              // temperature
                {
                    show_temperature = 1;
                    log_message ("overlay temperature");
                    break;
                }
                case OVERLAY_TYPE_WEATHER_ICON:                                                             // weather icon
                {
                    weather_query (1);
                    icon_duration = overlay.overlays[show_overlay_idx].duration;
                    log_message ("overlay weather icon");
                    break;
                }
                case OVERLAY_TYPE_WEATHER:                                                                  // weather
                {
                    weather_query (0);
                    log_message ("overlay weather");
                    break;
                }
                case OVERLAY_TYPE_TICKER:                                                                   // ticker
                {
                    log_printf ("overlay ticker: '%s'\r\n", overlay.overlays[show_overlay_idx].text);
                    display_set_ticker ((unsigned char *) overlay.overlays[show_overlay_idx].text, 1);      // display ticker and wait
                    display_clock_flag = DISPLAY_CLOCK_FLAG_UPDATE_ALL;                                     // update display after ticker
                    break;
                }
                case OVERLAY_TYPE_MP3:                                                                      // mp3
                {
                    char *  p;
                    int     folder;
                    int     track;

                    p = strchr (overlay.overlays[show_overlay_idx].text, '/');

