RT-CUSTOMZ/WortUhr/Software/STM32/src/main.c
                    if (p)
                    {
                        uint_fast16_t   cur_minute = 60 * hour + minute;

                        folder = atoi (overlay.overlays[show_overlay_idx].text);
                        track  = atoi (p + 1);

                        if (do_play_dfplayer (cur_minute))
                        {
                            log_printf ("overlay mp3: %02d/%03d\r\n", folder, track);
                            dfplayer_play_folder (folder, track);
                        }
                    }
                    else
                    {
                        log_printf ("overlay mp3: invalid format: %s\r\n", overlay.overlays[show_overlay_idx].text);
                    }
                    break;
                }
            }

            show_overlay_idx = 0xFF;
        }
        else if (show_icon_stop_time > 0)
        {
            if (show_icon_stop_time == 0xFFFFFFFF)                                      // waiting for end of animation?
            {
                 if (! display.animation_start_flag && display.animation_stop_flag)     // animation running?
                 {                                                                      // no, ...
                    show_icon_stop_time = local_uptime + 5;                             // show temperature 5 seconds long
                 }
            }
            else if (local_uptime >= show_icon_stop_time)                               // 5 seconds gone?
            {                                                                           // yes, ...
                show_icon_stop_time = 0;                                                // reset flag
                display_clock_flag = DISPLAY_CLOCK_FLAG_UPDATE_ALL;                     // and force update of display
            }
        }

        if (show_temperature)
        {
            show_temperature = 0;

            if (ds18xx_temperature_index != 0xFF)
            {
                display_temperature (ds18xx_temperature_index);
                show_icon_stop_time = 0xFFFFFFFF;                                       // flag: wait for end of animation
            }
            else if (rtc_temperature_index != 0xFF)
            {
                display_temperature (rtc_temperature_index);
                show_icon_stop_time = 0xFFFFFFFF;                                       // flag: wait for end of animation
            }
        }

        if (show_date)
        {
            char datebuf[11];

            show_date = 0;
            sprintf (datebuf, "%02d.%02d.%d", gmain.tm.tm_mday, gmain.tm.tm_mon + 1, gmain.tm.tm_year + 1900);
            display_set_ticker ((unsigned char *) datebuf, 1);                          // display date and wait
            display_clock_flag = DISPLAY_CLOCK_FLAG_UPDATE_ALL;                         // update display after ticker
        }

        if (display_clock_flag)                                                         // refresh display (time/mode changed)
        {
            debug_log_message ("update display");

#if WCLOCK24H == 1
            if (display.display_mode == MODES_COUNT - 1)                                // temperature
            {
                uint_fast8_t temperature_index;

                if (ds18xx.is_up)
                {
                    temperature_index = temp_read_temp_index ();
                    log_printf ("got temperature from DS18xxx: %d%s\r\n", temperature_index / 2, (temperature_index % 2) ? ".5" : "");
                }
                else if (grtc.rtc_is_up)
                {
                    temperature_index = rtc_get_temperature_index ();
                    log_printf ("got temperature from RTC: %d%s\r\n", temperature_index / 2, (temperature_index % 2) ? ".5" : "");
                }
                else
                {
                    temperature_index = 0x00;
                    debug_log_message ("no temperature available");
                }

                display_clock (0, temperature_index - 20, display_clock_flag);          // show temperature
            }
            else
            {
                display_clock (hour, minute, display_clock_flag);                       // show new time
            }
#else
            display_clock (hour, minute, display_clock_flag);                           // show new time
#endif
            display_clock_flag = DISPLAY_CLOCK_FLAG_NONE;
        }

        if (animation_flag)
        {
            animation_flag = 0;
            display_animation ();
        }

        if (seconds_flag)
        {
            seconds_flag = 0;
            display_seconds (second);
        }

        cmd = remote_ir_get_cmd ();                                                     // get IR command

        if (cmd != REMOTE_IR_CMD_INVALID)                                               // got IR command, light green LED
        {
            display_set_status_led (1, 0, 0);
            status_led_cnt = STATUS_LED_FLASH_TIME;
        }

        switch (cmd)
        {
            case REMOTE_IR_CMD_POWER:
            {
                display_clock_flag = toggle_power (TRUE);
                debug_log_message ("IRMP: POWER key");
                break;
            }

            case REMOTE_IR_CMD_OK:
            {
                debug_log_message ("IRMP: OK key, not used anymore");
                break;
            }

            case REMOTE_IR_CMD_DECREMENT_DISPLAY_MODE:                                  // decrement display mode
            {
                display_decrement_display_mode (TRUE);
                display_clock_flag = DISPLAY_CLOCK_FLAG_UPDATE_ALL;
                debug_log_message ("IRMP: decrement display mode");
                break;
            }

            case REMOTE_IR_CMD_INCREMENT_DISPLAY_MODE:                                  // increment display mode
            {
                display_increment_display_mode (TRUE);
                display_clock_flag = DISPLAY_CLOCK_FLAG_UPDATE_ALL;
                debug_log_message ("IRMP: increment display mode");
                break;
            }

            case REMOTE_IR_CMD_DECREMENT_ANIMATION_MODE:                                // decrement display mode
            {
                display_decrement_animation_mode (TRUE);
                display_clock_flag = DISPLAY_CLOCK_FLAG_UPDATE_ALL;
                debug_log_message ("IRMP: decrement animation mode");
                break;
            }

            case REMOTE_IR_CMD_INCREMENT_ANIMATION_MODE:                                // increment display mode
            {
                display_increment_animation_mode (TRUE);
                display_clock_flag = DISPLAY_CLOCK_FLAG_UPDATE_ALL;
                debug_log_message ("IRMP: increment animation mode");
                break;
            }

