RT-CUSTOMZ/WortUhr/Software/STM32/src/main.c
            case REMOTE_IR_CMD_GET_TEMPERATURE:                                         // get temperature
            {
                show_temperature = 1;
                debug_log_message ("IRMP: get temperature");
                break;
            }

            default:
            {
                break;
            }
        }

        if (time_changed)
        {
            if (grtc.rtc_is_up)
            {
                gmain.tm.tm_year = year - 1900;
                gmain.tm.tm_mon  = month - 1;
                gmain.tm.tm_mday = mday;
                gmain.tm.tm_hour = hour;
                gmain.tm.tm_min  = minute;
                gmain.tm.tm_sec  = second;
                gmain.tm.tm_wday = wday;
                rtc_set_date_time (&gmain.tm);
            }

            time_changed = 0;
        }

        dfplayer_read_message ();

        if (dfplayer.is_up)
        {
            static uint_fast8_t last_dfplayer_is_up;
            static uint_fast8_t last_minute = 0xFF;

            if (! last_dfplayer_is_up)
            {
                last_dfplayer_is_up = 1;
                log_message ("dfplayer is online");
            }

            if (last_minute != minute)
            {
                uint_fast16_t   cur_minute = 60 * hour + minute;
                uint_fast8_t    alarm_idx;

                alarm_idx = alarm_check_alarm_times (wday, cur_minute);

                if (alarm_idx > 0)
                {
                    log_printf ("%d %02d:%02d alarm_idx = %d\r\n", wday, hour, minute, alarm_idx);
                    dfplayer_play_folder (ALARM_FOLDER, alarm_idx);
                }
                else if (dfplayer.mode != DFPLAYER_MODE_NONE)
                {
                    if (do_play_dfplayer (cur_minute))
                    {
                        if (dfplayer.mode == DFPLAYER_MODE_BELL)
                        {
                            uint_fast8_t track = 0xFF;

                            if (minute == 0)
                            {
                                if (hour >= 12)
                                {
                                    if (hour == 12)
                                    {
                                        track = DFPLAYER_TRACK_HOUR12;
                                    }
                                    else
                                    {
                                        track = hour - 12;
                                    }
                                }
                                else
                                {
                                    track = hour;
                                }
                            }
                            else if (minute == 15)
                            {
                                if (dfplayer.bell_flags & DFPLAYER_MODE_BELL_FLAG_15)
                                {
                                    track = DFPLAYER_TRACK_HOUR_15M;
                                }
                            }
                            else if (minute == 30)
                            {
                                if (dfplayer.bell_flags & DFPLAYER_MODE_BELL_FLAG_30)
                                {
                                    track = DFPLAYER_TRACK_HOUR_30M;
                                }
                            }
                            else if (minute == 45)
                            {
                                if (dfplayer.bell_flags & DFPLAYER_MODE_BELL_FLAG_45)
                                {
                                    track = DFPLAYER_TRACK_HOUR_45M;
                                }
                            }

                            if (track != 0xFF)
                            {
                                dfplayer_play_folder (BELL_FOLDER, track);
                            }
                        }
                        else if (dfplayer.mode == DFPLAYER_MODE_SPEAK)
                        {
                            if (dfplayer.speak_cycle > 0 && minute % dfplayer.speak_cycle == 0)
                            {
                                speak (hour, minute);
                            }
                        }
                    }
                }

                last_minute = minute;
            }
        }
    }

    return 0;
}
